Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_jlx192128g.c
/**
 * @file bsp_gd32f303xx_jlx192128g.c
 * @author your name (you@domain.com)
 * @brief
 * @version 0.8
 * @date 2025-04-14
 *
 * @copyright Copyright (c) 2025
 *
 */

#include <string.h>
#include "gd32f30x_rcu.h"
#include "gd32f30x_gpio.h"
#include "gd32f30x_dma.h"
#include "gd32f30x_spi.h"
#include "bsp_assert.h"
#include "bsp_malloc.h"
#include "bsp_gd32f303xx_jlx192128g.h"
#include "bsp_gd32f303xx_systick.h"
#include "bsp_font.h"
#include "jlx_display_ext.h"

#define LCD_SPI_INTERFACE SPI0

#define JLX_SPI_RST_GPIO_CLK_ENABLE()       \
    do                                      \
    {                                       \
        rcu_periph_clock_enable(RCU_GPIOB); \
    } while (0)

#define JLX_SPI_RS_GPIO_CLK_ENABLE()        \
    do                                      \
    {                                       \
        rcu_periph_clock_enable(RCU_GPIOB); \
    } while (0)

#define JLX_SPI_CS_GPIO_CLK_ENABLE()        \
    do                                      \
    {                                       \
        rcu_periph_clock_enable(RCU_GPIOA); \
    } while (0)

#define JLX_BL_GPIO_CLK_ENABLE()            \
    do                                      \
    {                                       \
        rcu_periph_clock_enable(RCU_GPIOC); \
    } while (0)

// @todo 需要编写通配符数据显示函数
#define SPI0_DATA_ADDRESS 0x4001300C

#define JLX_SPI_RST(x)                                                                                                               \
    do                                                                                                                               \
    {                                                                                                                                \
        x ? gpio_bit_set(JLX_SPI_RST_GPIO_PORT, JLX_SPI_RST_GPIO_PIN) : gpio_bit_reset(JLX_SPI_RST_GPIO_PORT, JLX_SPI_RST_GPIO_PIN); \
    } while (0)
#define JLX_SPI_RS(x)                                                                                                            \
    do                                                                                                                           \
    {                                                                                                                            \
        x ? gpio_bit_set(JLX_SPI_RS_GPIO_PORT, JLX_SPI_RS_GPIO_PIN) : gpio_bit_reset(JLX_SPI_RS_GPIO_PORT, JLX_SPI_RS_GPIO_PIN); \
    } while (0)
#define JLX_SPI_CS(x)                                                                                                            \
    do                                                                                                                           \
    {                                                                                                                            \
        x ? gpio_bit_set(JLX_SPI_CS_GPIO_PORT, JLX_SPI_CS_GPIO_PIN) : gpio_bit_reset(JLX_SPI_CS_GPIO_PORT, JLX_SPI_CS_GPIO_PIN); \
    } while (0)
#define JLX_BL(x)                                                                                                \
    do                                                                                                           \
    {                                                                                                            \
        x ? gpio_bit_set(JLX_BL_GPIO_PORT, JLX_BL_GPIO_PIN) : gpio_bit_reset(JLX_BL_GPIO_PORT, JLX_BL_GPIO_PIN); \
    } while (0)

static void vCHNHashMake(void);
static void vCHNHashMake16x16(void);
static void vLcdSoftInit(void);
static void vLcdDmaInit(void);
static void vSpiSendData(uint8_t byte);
static void vSpiSendCmd(uint8_t byte);
static void vLcdSetCursor(uint8_t sx, uint8_t sy, uint8_t lenx, uint8_t leny);
static void vShowCHNChar(uint16_t _usx, uint16_t _usy, uint8_t *_pcStr, uint8_t _ucSize, uint8_t _ucMode);
static void vShowENGChar(uint16_t _usx, uint16_t _usy, uint8_t *_pcStr, uint8_t _ucSize, uint8_t _ucMode);

// 外部声明字体数据
extern const FONT_CHN16X16_t Chinese_text_16x16[];
extern const char english_text_8x16[];
extern const FONT_CHN13X16_t Chinese_text_13x16[];
extern const char english_text_7x16[];

static char frame_buffer_0[192 * 16] = {0};
static char frame_buffer_1[192 * 16] = {0};
static char *frame_buffer = frame_buffer_0;

#ifdef JLX_SPIDMA
/**
 * @brief SPI0 TX(MOSI) according to DMA0_CH2
 *
 */
static void vLcdDmaInit(void)
{
    dma_parameter_struct dma_init_struct;

    rcu_periph_clock_enable(RCU_DMA0);

    /* */
    dma_struct_para_init(&dma_init_struct);
    dma_deinit(DMA0, DMA_CH2);

    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_addr = (uint32_t)frame_buffer;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
    dma_init_struct.number = 1;
    dma_init_struct.periph_addr = SPI0_DATA_ADDRESS;
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
    dma_init_struct.priority = DMA_PRIORITY_LOW; /* FIXME: 需要对优先级进行核对 */
    dma_init(DMA0, DMA_CH2, &dma_init_struct);

    /* configure DMA mode */
    dma_circulation_disable(DMA0, DMA_CH2);
    dma_memory_to_memory_disable(DMA0, DMA_CH2);
    dma_channel_enable(DMA0, DMA_CH2);
    spi_dma_enable(SPI0, SPI_DMA_TRANSMIT); /* 预先置位FTF */
}
#endif

/**
 * @brief LCD初始化函数
 *
 */
void bsp_JLXLcdInit(void)
{
    spi_parameter_struct spi_init_struct = {0};

    JLX_SPI_RST_GPIO_CLK_ENABLE();
    JLX_SPI_RS_GPIO_CLK_ENABLE();
    JLX_SPI_CS_GPIO_CLK_ENABLE();
    JLX_BL_GPIO_CLK_ENABLE();

    rcu_periph_clock_enable(RCU_AF);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_SPI0);

    /* SPI0_SCK(PA5), SPI0_MISO(PA6) and SPI0_MOSI(PA7) GPIO pin configuration */
    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_5 | GPIO_PIN_7);
    // gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
    /* SPI0_CS(PA4) GPIO pin configuration */
    gpio_init(JLX_SPI_CS_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, JLX_SPI_CS_GPIO_PIN);
    gpio_init(JLX_SPI_RS_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, JLX_SPI_RS_GPIO_PIN);
    gpio_init(JLX_SPI_RST_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, JLX_SPI_RST_GPIO_PIN);
    gpio_init(JLX_BL_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, JLX_BL_GPIO_PIN);

    /* chip select invalid*/
    JLX_SPI_CS(1);

    /* deinit spi */
    spi_i2s_deinit(LCD_SPI_INTERFACE);

    /* LCD_SPI_INTERFACE parameter config */
    spi_init_struct.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
    spi_init_struct.device_mode = SPI_MASTER;
    spi_init_struct.frame_size = SPI_FRAMESIZE_8BIT;
    spi_init_struct.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
    spi_init_struct.nss = SPI_NSS_SOFT;
    spi_init_struct.prescale = SPI_PSC_8; // 60/8 = 7.5M
    spi_init_struct.endian = SPI_ENDIAN_MSB;
    spi_init(LCD_SPI_INTERFACE, &spi_init_struct);

