Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_jlx192128g.c
    /* enable LCD_SPI_INTERFACE */
    spi_enable(LCD_SPI_INTERFACE);

    vLcdSoftInit();

    JLX_BL(1); /* open back light */

#ifdef JLX_SPIDMA
    vLcdDmaInit();
    vLcdSetCursor(0, 0, 192, 16); /* 进行一次窗口配置 */
    bsp_JLXLcdClearScreen(0x00);
    bsp_JLXLcdRefreshScreen();
    JLX_DisplayExt_Init(frame_buffer);
#endif
}

/**
 * @brief Stop dma channel and command lcd module to enter sleep, close back light.
 *
 */
void bsp_JLXLcdEnterSleepMode(void)
{
    volatile uint32_t dly = 20000;
#ifdef JLX_SPIDMA
    dma_channel_disable(DMA0, DMA_CH2);
    while (dly--)
        ;
#endif
    vSpiSendCmd(0x30); // EXT=0
    vSpiSendCmd(0x95); // Enter Sleep
    JLX_BL(0);
    dly = 20000;
    while (dly--)
        ;
}

/**
 * @brief Wake up lcd module and open back light, restart dma transmit.
 *
 */
void bsp_JLXLcdExitSleepMode(void)
{
    vSpiSendCmd(0x30); // EXT=0
    vSpiSendCmd(0x94); // Sleep out
#ifdef JLX_SPIDMA
    vLcdDmaInit();
    vLcdSetCursor(0, 0, 192, 16); /* 进行一次窗口配置 */
#endif
    JLX_BL(1);
}

void bsp_JLXLcdShowUnderline(uint32_t _usx, uint32_t _usy, uint32_t len)
{
    /* 非法参数检测 */
    bsp_assert(_usx < JLXLCD_W);
    bsp_assert(_usy < (JLXLCD_H / 8));

    for (; len != 0; len--)
    {
        frame_buffer[_usy * JLXLCD_W + _usx] |= 0x01;
        if (++_usx == JLXLCD_W)
            return;
    }
}
/**
 * @brief 字符显示，可显示字母或汉字
 *
 * @param _usx
 * @param _usy  // 防止参数检测时溢出误判
 * @param _pString
 * @param size  0为正常大小，1为大字符(大字符目前不支持使用)
 * @param mode
 */
void bsp_JLXLcdShowString(uint16_t _usx, uint16_t _usy, const char *_pcStr, uint8_t _ucSize, uint8_t _ucMode)
{
    uint8_t _ucEntLine = 2;
    uint8_t _ucEngWSize = 8;
    uint8_t _ucChnWSize = 16;
    uint8_t _ucCharType = 0; // english default

    /* 非法参数检测 */
    bsp_assert(_usx < JLXLCD_W);
    bsp_assert(_usy < (JLXLCD_H / 8));

    /* 根据字体大小设置调整参数 */
    if (_ucSize == 0)
    {
        _ucEntLine = 2;
#ifdef CHN13X16
        _ucChnWSize = 13; /* XXX: 修改该值，可以调整字间距 */
#else
        _ucChnWSize = 16;
#endif
        _ucEngWSize = 8;
    }
    else if (_ucSize == 1)
    {
        _ucEntLine = 2;
        _ucChnWSize = 18;
        _ucEngWSize = 8;
    }
    else
    {
        _ucEntLine = 3;
        _ucChnWSize = 24;
        _ucEngWSize = 12;
    }

    /* 绘制单个字符 */
    while (*_pcStr != '\0')
    {
        _ucCharType = (*_pcStr & 0x80);

        if ((_usx + (_ucCharType ? _ucChnWSize : _ucEngWSize)) > JLXLCD_W)
        { // 换行
            _usx = 0;
            if ((_usy + _ucEntLine) * 8 >= JLXLCD_H)
            {
                return;
            }
            else
            {
                return;
            }
        }

        if (_ucCharType)
        { /* 该字符为汉字 */
            vShowCHNChar(_usx, _usy, (uint8_t *)_pcStr, _ucSize, _ucMode);
            _pcStr += 2;
            _usx += _ucChnWSize;
        }
        else
        {
            vShowENGChar(_usx, _usy, (uint8_t *)_pcStr, _ucSize, _ucMode);
            _pcStr += 1;
            _usx += _ucEngWSize;
        }
    }
}

/**
 * @brief LCD 浮点型数据显示，仅对小数点进行特殊处理
 *       （注：该函数不支持换行，需注意字符数组长度）
 *
 * @param _usx 起始列坐标
 * @param _usy 起始行坐标
 * @param _pcStr 需要提前使用sprintf()函数将浮点数据转换为为指定对齐、指定小数点数、指定补零的字符数组
 * @param _ucSize 字符大小，目前仅支持8x16=0
 * @param _ucMode =0为正常显示，=1为反显
 */
void bsp_JLXLcdShowFloatNum(uint16_t _usx, uint16_t _usy, uint8_t *_pcStr, uint8_t _ucSize, uint8_t _ucMode)
{
    uint8_t usASCIndex = *_pcStr - ' ';
    uint8_t i;
#ifdef JLX_SPIDMA
    if (usASCIndex > 94) // ASCII位置超限
        return;

    while (*_pcStr != '\0')
    {
        if (_ucSize == 0)
        { // 8x16字符
            if (*_pcStr == '.')
            {
                frame_buffer[(_usy + 1) * 192 + _usx - 1] &= 0x80;
            }
            else if (*_pcStr > '9' || *_pcStr < '0')
            {
                return;
            }
            else
            {
                for (i = 0; i < 16; i++)
                {
                    if (!_ucMode)
                    {
                        frame_buffer[_usx + (_usy + i / 8) * 192 + (i % 8)] = english_text_8x16[usASCIndex * 16 + i];
                    }
                    else
                    {
                        frame_buffer[_usx + (_usy + i / 8) * 192 + (i % 8)] = ~(english_text_8x16[usASCIndex * 16 + i]);
                    }
                }
                _usx += 8;
            }
        }
        else
        {
            __NOP();
        }
        _pcStr += 1;
    }

#else
#endif
}

/**
 * @brief 清除一片长方形区域
 *
 * @param _ucx 起始列坐标
 * @param _ucxCnt 列宽
 * @param _ucy 起始行坐标   （注：液晶屏以8像素为一行, 实际行总数仅16行）
 * @param _ucyCnt 行宽
 * @param _ucColor 0x00（全白） 或 0xff（全黑）
 */
void bsp_JLXLcdClearRect(uint8_t _ucx, uint8_t _ucxCnt, uint8_t _ucy, uint8_t _ucyCnt, uint8_t _ucColor)
{
    int i, j;
#ifdef JLX_SPIDMA
    for (i = 0; i < _ucyCnt && (_ucy + i) < JLXLCD_H / 8; i++)
    { /* 数组边界保护 */
        for (j = _ucx; j < _ucxCnt + _ucx && j < JLXLCD_W; j++)
        { /* 数组边界保护 */
            frame_buffer[(_ucy + i) * 192 + j] = _ucColor;
        }
    }
#else
    vLcdSetCursor(_ucx, _ucy, _ucxCnt, _ucyCnt);
    for (i = 0; i < _ucyCnt; i++)
    {
        for (j = 0; j < _ucxCnt; j++)
        {
            vSpiSendData(_ucColor);
        }
    }
#endif
}

/**
 * @brief 以8像素行形式填充整行
 *
 * @param _ucy 起始行坐标
 * @param _ucyCnt 行数
 * @param _ucColor 填充阵列
 */
void bsp_JLXLcdClearLine(uint8_t _ucy, uint8_t _ucyCnt, uint8_t _ucColor)
{
    int i, j;
#ifdef JLX_SPIDMA
    for (i = 0; i < _ucyCnt && (_ucy + i) < JLXLCD_H / 8; i++)
    { /* 数组边界保护 */ /* FIXME: 紧急bug修复, 此处数组越界 */
        for (j = 0; j < 192; j++)
        {
            frame_buffer[(_ucy + i) * 192 + j] = _ucColor;
        }
    }
#else
    vLcdSetCursor(0, _ucy, 192, _ucyCnt);
    for (i = 0; i < _ucyCnt; i++)
    {
        for (j = 0; j < 192; j++)
        {
            vSpiSendData(_ucColor);
        }
    }
#endif
}

void bsp_JLXLcdClearScreen(uint8_t color)
{
#ifdef JLX_SPIDMA
    memset(frame_buffer, color, 192 * 16);
#else
    uint8_t i = 0, j = 0;
    /* set cursor */
    vLcdSetCursor(0, 0, 192, 16);
    for (i = 0; i < 16; i++)
    {
        for (j = 0; j < 192; j++)
        {
            vSpiSendData(color);
        }
    }
#endif
}

/**
 * @brief DMA屏幕刷新
 *
 */
void bsp_JLXLcdRefreshScreen(void)
{
#ifdef JLX_SPIDMA
    while (!dma_flag_get(DMA0, DMA_CH2, DMA_FLAG_FTF))
        ;
    dma_flag_clear(DMA0, DMA_CH2, DMA_FLAG_FTF);
    while (spi_i2s_flag_get(SPI0, SPI_FLAG_TRANS))
        ;
    JLX_SPI_CS(1);

    dma_channel_disable(DMA0, DMA_CH2);
    dma_memory_address_config(DMA0, DMA_CH2, (uint32_t)frame_buffer);
//    if (frame_buffer == frame_buffer_0)
//    {
//        frame_buffer = frame_buffer_1;
//    }
//    else
//    {
//        frame_buffer = frame_buffer_0;
//    }
    dma_transfer_number_config(DMA0, DMA_CH2, 192 * 16);
    JLX_SPI_RS(1);
    JLX_SPI_CS(0); // 片选，必须在传输开始之前片选，否则影响屏幕显示
    dma_channel_enable(DMA0, DMA_CH2);
    spi_dma_enable(SPI0, SPI_DMA_TRANSMIT);
#endif
}

/**
 * @brief LCD软件初始化
 *
 */
static void vLcdSoftInit(void)
{
    vCHNHashMake();
    vCHNHashMake16x16();
    JLX_SPI_RST(0);
    bsp_delay(100);
    JLX_SPI_RST(1);
    bsp_delay(100);

    // vSpiSendCmd(0x30);  // EXT = 0
    // vSpiSendCmd(0xaf);  // display on
    // vSpiSendCmd(0xa6);  // 正常显示
    // vSpiSendCmd(0x23);  // 打开所有像素

    // vSpiSendCmd(0xca);
    // vSpiSendData(0x00);
    // vSpiSendData(0x4f);
    // vSpiSendData(0x0e);

    // vSpiSendCmd(0x94);  //推出sleep模式

