Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_jlx192128g.c
    // vSpiSendCmd(0x75);
    // vSpiSendData(0x00);
    // vSpiSendData(0x0f); //128

    // vSpiSendCmd(0x15);
    // vSpiSendData(0x00);
    // vSpiSendData(0xbf); // 191

    // vSpiSendCmd(0xbc);
    // vSpiSendData(0x00);

    // vSpiSendCmd(0xd1);

    // vSpiSendCmd(0xa3);
    // vSpiSendData(0x0b);

    // vSpiSendCmd(0x81);
    // vSpiSendData(0x1f);
    // vSpiSendData(0x03);

    // vSpiSendCmd(0xd6);

    // vSpiSendCmd(0x08);

    // vSpiSendCmd(0xf0);
    // vSpiSendData(0x10);

    // vSpiSendCmd(0x6e);

    // vSpiSendCmd(0x76);

    // vSpiSendCmd(0x32);
    // vSpiSendData(0x00);
    // vSpiSendData(0x01);
    // vSpiSendData(0x04);

    // vSpiSendCmd(0x51);
    // vSpiSendData(0xfb);

    // vSpiSendCmd(0x40);

    // vSpiSendCmd(0x5c);

    vSpiSendCmd(0x30);  // EXT=0
    vSpiSendCmd(0x94);  // Sleep out
                        // vSpiSendCmd(0xa7);
    vSpiSendCmd(0x31);  // EXT=1
    vSpiSendCmd(0xD7);  // Autoread disable
    vSpiSendData(0X9F); //
    vSpiSendCmd(0x32);  // Analog SET
    vSpiSendData(0x00); // OSC Frequency adjustment
    vSpiSendData(0x01); // Frequency on booster capacitors->6KHz
    vSpiSendData(0x02); // Bias=1/12
    vSpiSendCmd(0x31);  // Analog SET
    vSpiSendCmd(0xf2);  // 温度补偿
    vSpiSendData(0x1e); // OSC Frequency adjustment
    vSpiSendData(0x28); // Frequency on booster capacitors->6KHz
    vSpiSendData(0x32); //
    vSpiSendCmd(0x20);  // Gray Level
    vSpiSendData(0x01);
    vSpiSendData(0x03);
    vSpiSendData(0x05);
    vSpiSendData(0x07);
    vSpiSendData(0x09);
    vSpiSendData(0x0b);
    vSpiSendData(0x0d);
    vSpiSendData(0x10);
    vSpiSendData(0x11);
    vSpiSendData(0x13);
    vSpiSendData(0x15);
    vSpiSendData(0x17);
    vSpiSendData(0x19);
    vSpiSendData(0x1b);
    vSpiSendData(0x1d);
    vSpiSendData(0x1f);
    vSpiSendCmd(0x30);  // EXT=0
    vSpiSendCmd(0x75);  // Page Address setting
    vSpiSendData(0X00); // XS=0
    vSpiSendData(0X14); // XE=159
    vSpiSendCmd(0x15);  // Clumn Address setting
    vSpiSendData(0X00); // XS=0
    vSpiSendData(0Xbf); // XE=256
    vSpiSendCmd(0xBC);  // Data scan direction
    vSpiSendData(0x02); // MX.MY=Normal
    vSpiSendCmd(0x08);  // 数据格式，0x0C：表示选择LSB（DB0)在顶; 0x08:表示选择LSB(DB0)在底
    vSpiSendCmd(0xCA);  // Display Control
    vSpiSendData(0X00); //
    vSpiSendData(0X7F); // Duty=128
    vSpiSendData(0X20); // Nline=off
    vSpiSendCmd(0xf0);  // Display Mode
    vSpiSendData(0X10); // 10=Monochrome Mode,11=4Gray
    vSpiSendCmd(0x81);  // EV control /*调对比度,VOP=15.05V*/
    vSpiSendData(0x1e); // VPR[5-0] /*微调对比度的值，可设置范围0x00～0x3f*/
    vSpiSendData(0x04); // VPR[8-6] /*粗调对比度，可设置范围0x00～0x07*/
    vSpiSendCmd(0x20);  // Power control
    vSpiSendData(0x0B); // D0=regulator ; D1=follower ; D3=booste, on:1 off:0
    bsp_delay(1);
    vSpiSendCmd(0xAF); // Display on
}

static inline uint32_t ulCHNHashFunc(const uint32_t key)
{
    return (key + (key >> 4)) & 0x1FF;
}

struct chn_hash_list
{
    struct chn_hash_list *next;
    uint32_t idx;
};

uint8_t hash_init_flag = 0;
struct chn_hash_list *chn_hash_13x16[512];
static void vCHNHashMake(void)
{
    int i;
    uint16_t b16tmp;
    uint32_t b32tmp;
    int usCNCnt = usCNCntGet_13x16();
    struct chn_hash_list *pNewNode;
    struct chn_hash_list *pCurr;

    /* 避免重复初始化 */
    if (hash_init_flag != 0)
        return;

    /* 清空所有桶 */
    memset(chn_hash_13x16, 0, 512 * sizeof(struct chn_hash_list *));
    hash_init_flag = 1;

    for (i = 0; i < usCNCnt; i++)
    {
        /* 获取汉字编码（小端序，取决于实际存储） */
        b16tmp = *((uint16_t *)Chinese_text_13x16[i]._ucIndex);
        b32tmp = ulCHNHashFunc(b16tmp);  /* 计算哈希桶索引 0~511 */
        if(b32tmp == 0x153)
        {
            __NOP();
        }
        /* 分配新节点 */
        pNewNode = (struct chn_hash_list *)bsp_malloc(sizeof(struct chn_hash_list));
        if (pNewNode == NULL)
        {
            bsp_assert(1);  /* 内存分配失败，系统死机 */
        }
        pNewNode->idx = i;
        pNewNode->next = NULL;

        /* 插入到对应桶的链表尾部 */
        if (chn_hash_13x16[b32tmp] == NULL)
        {
            /* 桶为空，新节点成为头节点 */
            chn_hash_13x16[b32tmp] = pNewNode;
        }
        else
        {
            /* 遍历到链表末尾 */
            pCurr = chn_hash_13x16[b32tmp];
            while (pCurr->next != NULL)
            {
                pCurr = pCurr->next;
            }
            pCurr->next = pNewNode;
        }
    }
}
uint8_t hash_init_flag_16x16 = 0;
struct chn_hash_list *chn_hash_16x16[512];
static void vCHNHashMake16x16(void)
{
    int i;
    uint16_t b16tmp;
    int b32tmp;
    int usCNCnt = usCNCntGet_16x16();
    struct chn_hash_list *ptmp;

    if (hash_init_flag_16x16 != 0)
        return;

    memset(chn_hash_16x16, 0, 512 * sizeof(struct chn_hash_list *));
    hash_init_flag_16x16 = 1;
    for (i = 0; i < usCNCnt; i++)
    {
        b16tmp = *((uint16_t *)Chinese_text_16x16[i]._ucIndex);
        b32tmp = ulCHNHashFunc(b16tmp);
        ptmp = (struct chn_hash_list *)(chn_hash_16x16 + b32tmp);
        while (ptmp->next != NULL)
        {
            ptmp = ptmp->next;
        }
        ptmp->next = (struct chn_hash_list *)bsp_malloc(sizeof(struct chn_hash_list));
        if (ptmp->next != NULL)
        {
            memset(ptmp->next, 0, sizeof(struct chn_hash_list));
            ptmp->next->idx = i;
        }
        else
        {
            bsp_assert(1);
        }
    }
}

uint32_t ulCHNHashMapGetIdx(const uint32_t key)
{
    struct chn_hash_list *pNode;
    uint32_t b32tmp;
    uint16_t b16tmp;
    uint32_t ret = 0xffff;

    /* 哈希表未初始化，返回无效索引 */
    if (!hash_init_flag)
        return 0xffff;

    /* 计算哈希桶索引 */
    b32tmp = ulCHNHashFunc(key);

    /* 获取对应桶的链表头 */
    pNode = chn_hash_13x16[b32tmp];

    /* 遍历链表，查找编码匹配的节点 */
    while (pNode != NULL)
    {
        /* 取出节点中存储的字库索引对应的汉字编码 */
        b16tmp = *((uint16_t *)Chinese_text_13x16[pNode->idx]._ucIndex);
        if (b16tmp == key)
        {
            ret = pNode->idx;   /* 找到，返回字库索引 */
            break;
        }
        pNode = pNode->next;    /* 继续下一个节点 */
    }

    return ret;
}

static uint32_t ulCHNHashMapGetIdx16x16(const uint32_t key)
{
    struct chn_hash_list *ptmp;
    uint16_t b16tmp;
    uint32_t b32tmp;
    uint32_t ret = 0xffff;
    if (!hash_init_flag_16x16)
        return 0xffff;

    b32tmp = ulCHNHashFunc(key);
    ptmp = (struct chn_hash_list *)(chn_hash_16x16 + b32tmp);
    while (ptmp->next != NULL)
    {
        b16tmp = *((uint16_t *)Chinese_text_16x16[ptmp->next->idx]._ucIndex); /* FIXME：此处读数据需要做边界保护 */
        if (b16tmp == key)
        {
            ret = ptmp->next->idx;
            break;
        }
        ptmp = ptmp->next;
    }

    return ret;
}

/**
 * @brief 绘制中文
 *
 * @param _usx
 * @param _usy
 * @param _pcStr
 * @param _ucSize
 * @param _ucMode
 */
static void vShowCHNChar(uint16_t _usx, uint16_t _usy, uint8_t *_pcStr, uint8_t _ucSize, uint8_t _ucMode)
{
    uint16_t usCNCnt = 0;
    uint32_t i, j, k;
    if (_ucSize == 0)
    { // 16x16字符
#ifdef CHN13X16
        usCNCnt = usCNCntGet_13x16();
#else
        usCNCnt = usCNCntGet_16x16();
#endif
        i = ulCHNHashMapGetIdx(*((uint16_t *)_pcStr));
        if (i >= usCNCnt)
            return;
#ifdef JLX_SPIDMA
#ifdef CHN13X16
        for (j = 0; j < 2; j++)
        {
            for (k = 0; k < 13; k++)
            {
                switch (_ucMode)
                {
                case 0:
                    frame_buffer[_usx + (_usy + j) * 192 + k] ^= Chinese_text_13x16[i]._ucCHN_Code[j * 13 + k];
                    break;
                case 1:
                    frame_buffer[_usx + (_usy + j) * 192 + k] ^= ~(Chinese_text_13x16[i]._ucCHN_Code[j * 13 + k]);
                    break;
                case 2:
                    if (j == 1)
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] = (Chinese_text_13x16[i]._ucCHN_Code[j * 13 + k]) | 0x01;
                    }
                    else
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] = (Chinese_text_13x16[i]._ucCHN_Code[j * 13 + k]);
                    }
                case 3:
                    if (((_usx + (_usy + j) * 192 + k) % 192 >= 1) && ((_usx + (_usy + j) * 192 + k) % 192 <= 192))
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] ^= Chinese_text_13x16[i]._ucCHN_Code[j * 13 + k];
                    }
                    break;
                }
            }
        }
#else
        for (j = 0; j < 32; j++)
        {
            if (!_ucMode)
            {
                frame_buffer[_usx + (_usy + j / 16) * 192 + (j % 16)] = Chinese_text_16x16[i]._ucCHN_Code[j];
            }
            else
            {
                frame_buffer[_usx + (_usy + j / 16) * 192 + (j % 16)] = ~(Chinese_text_16x16[i]._ucCHN_Code[j]);
            }
        }
#endif
#else
#ifdef CHN13X16
        vLcdSetCursor(_usx, _usy, 13, 2);
        for (j = 0; j < 26; j++)
        {
            if (!_ucMode)
            {
                vSpiSendData(Chinese_text_13x16[i]._ucCHN_Code[j]);
            }
            else
            {
                vSpiSendData(~(Chinese_text_13x16[i]._ucCHN_Code[j]));
            }
        }
#else
        vLcdSetCursor(_usx, _usy, 16, 2);
        for (j = 0; j < 32; j++)
        {
            if (!_ucMode)
            {
                vSpiSendData(Chinese_text_16x16[i]._ucCHN_Code[j]);
            }
            else
            {
                vSpiSendData(~(Chinese_text_16x16[i]._ucCHN_Code[j]));
            }
        }
#endif
#endif
    }
    else if (_ucSize == 1)
    { // 16x16字符
        usCNCnt = usCNCntGet_16x16();
        i = ulCHNHashMapGetIdx16x16(*((uint16_t *)_pcStr));
        if (i >= usCNCnt)
            return;
#ifdef JLX_SPIDMA
        //        for (j = 0; j < 32; j++)
        //        {
        //            if (!_ucMode)
        //            {
        //                frame_buffer[_usx + (_usy + j / 16) * 192 + (j % 16)] = Chinese_text_16x16[i]._ucCHN_Code[j];
        //            }
        //            else if(_ucMode == 1)
        //            {
        //                frame_buffer[_usx + (_usy + j / 16) * 192 + (j % 16)] = ~(Chinese_text_16x16[i]._ucCHN_Code[j]);
        //            }
        //						else if(_ucMode == 3)
        //            {
        //								if(((_usx + (_usy + j / 16) * 192 + (j % 16))%192 >=20)&&((_usx + (_usy + j / 16) * 192 + (j % 16))%192<=172))
        //                frame_buffer[_usx + (_usy + j / 16) * 192 + (j % 16)] ^= (Chinese_text_16x16[i]._ucCHN_Code[j]);
        //            }
        //        }
        for (j = 0; j < 2; j++)
        {
            for (k = 0; k < 16; k++)
            {
                switch (_ucMode)
                {
                case 0:
                    frame_buffer[_usx + (_usy + j) * 192 + k] ^= Chinese_text_16x16[i]._ucCHN_Code[j * 16 + k];
                    break;
                case 1:
                    frame_buffer[_usx + (_usy + j) * 192 + k] ^= ~(Chinese_text_16x16[i]._ucCHN_Code[j * 16 + k]);
                    break;
                case 2:
                    if (j == 1)
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] = (Chinese_text_16x16[i]._ucCHN_Code[j * 16 + k]) | 0x01;
                    }
                    else
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] = (Chinese_text_16x16[i]._ucCHN_Code[j * 16 + k]);
                    }
                case 3:
                    if (((_usx + (_usy + j) * 192 + k) % 192 >= 1) && ((_usx + (_usy + j) * 192 + k) % 192 <= 192))
                    {
                        frame_buffer[_usx + (_usy + j) * 192 + k] ^= Chinese_text_16x16[i]._ucCHN_Code[j * 16 + k];
                    }
                    break;
                }
            }
        }
#else
#endif
    }
    else if (_ucSize == 2)
    { // 24x24字符
        __NOP();
    }
}

/**
 * @brief 绘制英文
 *
 * @param _usx
 * @param _usy
 * @param _pcStr
 * @param _ucSize
 * @param _ucMode
 */
static void vShowENGChar(uint16_t _usx, uint16_t _usy, uint8_t *_pcStr, uint8_t _ucSize, uint8_t _ucMode)
{
    uint8_t usASCIndex = 0;
    uint32_t i, j;

