Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_jlx192128g.c
    usASCIndex = *_pcStr - ' ';
    if (usASCIndex > 94)
    { // ASCII位置超限
        return;
    }

    if (_ucSize == 0 || _ucSize == 1)
    { // 8x16字符
#ifdef JLX_SPIDMA
        for (i = 0; i < 2; i++)
        {
            for (j = 0; j < 8; j++)
            {
                switch (_ucMode)
                {
                case 0:
                    frame_buffer[_usx + (_usy + i) * 192 + j] ^= english_text_8x16[(usASCIndex << 4) + (i << 3) + j];
                    break;
                case 1:
                    frame_buffer[_usx + (_usy + i) * 192 + j] ^= ~(english_text_8x16[(usASCIndex << 4) + (i << 3) + j]);
                    break;
                case 2:
                    if (i == 1)
                    {
                        frame_buffer[_usx + (_usy + i) * 192 + j] = english_text_8x16[(usASCIndex << 4) + (i << 3) + j] | 0x01;
                    }
                    else
                    {
                        frame_buffer[_usx + (_usy + i) * 192 + j] = english_text_8x16[(usASCIndex << 4) + (i << 3) + j];
                    }
                    break;
                case 3:
                    if (((_usx + (_usy + i) * 192 + j) % 192 >= 10) && ((_usx + (_usy + i) * 192 + j) % 192 <= 186))
                    {
                        frame_buffer[_usx + (_usy + i) * 192 + j] ^= english_text_8x16[(usASCIndex << 4) + (i << 3) + j];
                    }
                    break;
                }
            }
        }
#else
        vLcdSetCursor(_usx, _usy, 8, 2);
        for (i = 0; i < 16; i++)
        {
            if (!_ucMode)
            {
                vSpiSendData(english_text_8x16[usASCIndex * 16 + i]);
            }
            else
            {
                vSpiSendData(~(english_text_8x16[usASCIndex * 16 + i]));
            }
        }
#endif
    }
    else if (_ucSize == 2)
    { // 16x16字符
    }
}

/**
 * @brief (阻塞)设置绘制窗口
 *
 * @param sx
 * @param sy
 * @param lenx
 * @param leny
 */
static void vLcdSetCursor(uint8_t sx, uint8_t sy, uint8_t lenx, uint8_t leny)
{
    vSpiSendCmd(0x30);                // EXT=0
    vSpiSendCmd(0x75);                // Page Address setting
    vSpiSendData(sy);                 // XS=0
    vSpiSendData(sy + leny - 1);      // XE=159
    vSpiSendCmd(0x15);                // Clumn Address setting
    vSpiSendData(sx + 64);            // XS=0
    vSpiSendData(sx + lenx + 64 - 1); // XE=191
    vSpiSendCmd(0x5c);                // wirte gram
}

/**
 * @brief (阻塞)SPI发送数据
 *
 * @param byte
 */
static void vSpiSendData(uint8_t byte)
{
    JLX_SPI_CS(0); // 片选
    JLX_SPI_RS(1);

    /* loop while data register in not emplty */
    while (RESET == spi_i2s_flag_get(LCD_SPI_INTERFACE, SPI_STAT_TBE))
        ;

    /* send byte through the LCD_SPI_INTERFACE peripheral */
    spi_i2s_data_transmit(LCD_SPI_INTERFACE, byte);

    /* loop while data register in not emplty */
    while (SET == spi_i2s_flag_get(LCD_SPI_INTERFACE, SPI_STAT_TRANS))
        ;

    JLX_SPI_CS(1);
}

/**
 * @brief (阻塞)SPI发送命令
 *
 * @param byte
 */
static void vSpiSendCmd(uint8_t byte)
{
    JLX_SPI_CS(0); // 片选
    JLX_SPI_RS(0);
    /* loop while data register in not emplty */
    while (RESET == spi_i2s_flag_get(LCD_SPI_INTERFACE, SPI_STAT_TBE))
        ;

    /* send byte through the LCD_SPI_INTERFACE peripheral */
    spi_i2s_data_transmit(LCD_SPI_INTERFACE, byte);

    /* loop while data register in not emplty */
    while (SET == spi_i2s_flag_get(LCD_SPI_INTERFACE, SPI_STAT_TRANS))
        ;

    JLX_SPI_CS(1);
}
void bsp_JLXLcdShow(uint16_t _usx, uint16_t _usy, uint16_t _width, uint16_t _height, const char *_icon, uint8_t _ucMode)
{
    uint32_t i, j, z = 0;
    for (i = 0; i < _height && (_usy + i) < JLXLCD_H / 8; i++)
    {
        for (j = _usx; j < _width + _usx && j < JLXLCD_W; j++)
        {
            frame_buffer[(_usy + i) * 192 + j] |= _icon[z++];
        }
    }
}
void bsp_JLXLcdShowBottonIcon(const char *bottonIcon)
{
    if (bottonIcon == NULL)
        return; // 如果指针为空，直接返回
    memcpy(frame_buffer, bottonIcon, 192 * 16);
}
/*B_WL增加函数*/

